---
kind: type
id: T:Autodesk.Revit.UI.FamilyInstancePlacingArgs
source: html/57954e0c-4ecc-6b12-41d1-10840640f50c.htm
---
# Autodesk.Revit.UI.FamilyInstancePlacingArgs

The class is used to access necessary data during the placement of a FamilyInstance.

## Syntax (C#)
```csharp
public class FamilyInstancePlacingArgs : IDisposable
```